{
  "id": "bug-reproducer",
  "name": "bug-reproducer",
  "version": "1.0.0",
  "description": "Create minimal, reliable reproduction of reported bugs from issues, logs, and user reports. Produces step-by-step reproduction cases with expected vs actual behavior.",
  "phase": "INIT",
  "category": "core",
  "content": "# Bug Reproducer\n\nCreate minimal, reliable reproduction cases from bug reports, failing tests, user-reported issues, and production error logs. The goal is to distill a noisy bug report into a precise, repeatable set of steps that any engineer can follow to observe the defect.\n\n## When to Use\n\n- A user or QA submits a bug report with incomplete reproduction steps\n- A test is failing intermittently and the cause is unclear\n- Production logs show errors that need local reproduction\n- A reported issue needs verification before prioritization\n- You need to confirm a bug still exists before investing in a fix\n\n## Process\n\n1. **Read the bug report or issue** - Gather all available information: user description, screenshots, error messages, stack traces, logs, and environment details.\n2. **Identify symptoms and environment** - Catalog the observable symptoms (error messages, incorrect behavior, crashes) and the environment where they occur (OS, browser, runtime version, configuration).\n3. **Create minimal reproduction steps** - Strip away everything unnecessary. Find the shortest path from a clean state to observing the bug. Each step should be a concrete, unambiguous action.\n4. **Verify reproduction is reliable** - Run the reproduction steps at least 3 times. If the bug is intermittent, document the success rate (e.g., \"reproduces 2 out of 5 attempts\") and any timing or ordering sensitivities.\n5. **Document expected vs actual behavior** - State clearly what should happen at each critical step and what actually happens instead. Include exact error messages, return values, or visual artifacts.\n6. **Identify related code paths** - Trace the reproduction steps to the relevant source files, functions, and lines. This primes the next phase (root cause analysis) with starting points.\n\n## Deliverables\n\n| Deliverable | Format | Purpose |\n|-------------|--------|---------|\n| BUG-REPRODUCTION.md | Markdown | Complete reproduction case with all details below |\n\n### BUG-REPRODUCTION.md Contents\n\n- **Summary**: One-sentence description of the defect\n- **Environment**: OS, runtime, versions, configuration, dependencies\n- **Steps to Reproduce**: Numbered, concrete steps from clean state to bug\n- **Expected Behavior**: What should happen\n- **Actual Behavior**: What actually happens (with error output)\n- **Error Output**: Full stack traces, logs, or screenshots\n- **Related Code Paths**: Source files, functions, and lines involved\n- **Frequency/Reliability**: How often the bug reproduces (e.g., 3/3, 2/5)\n- **Workarounds**: Any known workarounds, if applicable\n\n## Quality Criteria\n\n- Reproduction is reliable: reproduces at least 3 out of 3 attempts (or intermittent rate is documented)\n- Reproduction is minimal: uses the fewest steps possible to trigger the bug\n- Environment details are specific: exact versions, not ranges or \"latest\"\n- Steps are unambiguous: another engineer can follow them without clarification\n- Expected vs actual behavior is clearly separated\n- Error output is complete (not truncated)\n- Related code paths are identified (at least one file/function)",
  "references": [],
  "tags": [
    "debugging",
    "reproduction",
    "bugs",
    "triage"
  ],
  "dependsOn": []
}