{
  "id": "changelog-generator",
  "name": "changelog-generator",
  "version": "1.0.0",
  "description": "Generate structured changelogs from git history, PRs, and commit messages. Categorizes changes by type (Added, Changed, Deprecated, Removed, Fixed, Security) following Keep a Changelog format.",
  "phase": "DOCUMENT",
  "category": "core",
  "content": "# Changelog Generator\n\nGenerate a structured, human-readable changelog from git history, pull requests, and commit messages. Follow the Keep a Changelog format to produce entries that are useful to both developers and users. The changelog is the definitive record of what changed between versions.\n\n## When to Use\n\n- During the release process, after changes are scoped by the release planner\n- After a version is finalized but before it is published\n- When maintaining a running CHANGELOG.md for the project\n- When preparing release artifacts for distribution\n\n## Process\n\n1. **Read git log since last release tag** - Identify the last release tag and collect all commits between that tag and the current HEAD (or release branch tip). Include merge commits for PR context.\n2. **Parse commit messages and PR titles** - Extract the meaningful description from each change. Use PR titles when available (they are usually better-written than individual commit messages). Follow conventional commit prefixes if the project uses them (feat:, fix:, chore:, etc.).\n3. **Categorize by type** - Assign each change to one of the Keep a Changelog categories:\n   - **Added**: New features or capabilities\n   - **Changed**: Modifications to existing features\n   - **Deprecated**: Features marked for future removal\n   - **Removed**: Features or capabilities removed\n   - **Fixed**: Bug fixes\n   - **Security**: Vulnerability fixes or security improvements\n4. **Group by component or area** - Within each category, group related changes by the part of the system they affect (API, CLI, UI, database, etc.). This helps readers find relevant changes quickly.\n5. **Write human-readable descriptions** - Rewrite terse commit messages into clear, user-oriented descriptions. Each entry should answer: what changed and why it matters. Start with a verb (Add, Fix, Update, Remove).\n6. **Link to PRs and issues** - Add references to the relevant pull request or issue for each entry. Use the format `([#123](url))` for inline links.\n\n## Deliverables\n\n| Deliverable | Format | Purpose |\n|-------------|--------|---------|\n| CHANGELOG.md | Markdown (appended) | Versioned changelog following Keep a Changelog |\n\n### CHANGELOG.md Entry Format\n\n```markdown\n## [X.Y.Z] - YYYY-MM-DD\n\n### Added\n- Description of new feature ([#123](url))\n\n### Changed\n- Description of modification ([#124](url))\n\n### Fixed\n- Description of bug fix ([#125](url))\n\n### Security\n- Description of security fix ([#126](url))\n```\n\nFollow the full specification at [keepachangelog.com](https://keepachangelog.com).\n\n## Quality Criteria\n\n- Every meaningful change is included (no silent changes that surprise users)\n- Categories are correct (a bug fix is not listed under \"Added\")\n- Descriptions are human-readable and user-oriented (not raw commit messages like \"fix stuff\")\n- Each entry starts with a verb and describes what changed from the user's perspective\n- PR or issue links are included for traceability\n- Internal-only changes (CI config, test refactors) are either omitted or clearly marked as internal\n- The version number and date match the release plan\n- The format follows Keep a Changelog conventions exactly",
  "references": [],
  "tags": [
    "release",
    "changelog",
    "documentation",
    "versioning"
  ],
  "dependsOn": [
    "release-planner"
  ]
}