{
  "id": "compatibility-checker",
  "name": "compatibility-checker",
  "version": "1.0.0",
  "description": "Verify API, schema, and interface compatibility between old and new versions during migrations. Tests backward compatibility, data format changes, and integration contracts.",
  "phase": "SCAFFOLD",
  "category": "engineering",
  "content": "# Compatibility Checker\n\nVerify that changes maintain compatibility where required and that breaking changes are explicitly documented with migration paths. Checks APIs, schemas, data formats, configuration files, and integration contracts between old and new versions.\n\n## When to Use\n\n- During a migration, after the migration plan is defined\n- After any API changes (new endpoints, modified signatures, removed fields)\n- When updating database schemas that have existing data\n- After modifying interfaces consumed by external systems or other services\n- Before releasing a new version that must maintain backward compatibility\n\n## Process\n\n1. **Catalog all public interfaces** - List every API endpoint, exported function, database schema, configuration format, event schema, and CLI interface that external consumers depend on. Include version information.\n2. **Compare old vs new signatures** - For each interface, diff the old and new definitions. Check parameter types, return types, required vs optional fields, default values, and ordering.\n3. **Check data format compatibility** - Verify that existing data (database rows, cached values, serialized objects, config files) can be read by the new version without transformation. Test with real production data samples where possible.\n4. **Verify integration contracts** - For each external integration (upstream API, downstream consumer, third-party service), confirm the contract is still satisfied. Check request/response formats, authentication, rate limits, and error handling.\n5. **Test backward compatibility** - Run old clients against new servers (and vice versa if relevant). Verify that existing workflows continue to function without modification.\n6. **Document breaking changes with migration paths** - For every incompatibility found, document: what broke, who is affected, and the specific steps consumers must take to migrate. Provide code examples where helpful.\n\n## Deliverables\n\n| Deliverable | Format | Purpose |\n|-------------|--------|---------|\n| COMPATIBILITY-REPORT.md | Markdown | Full compatibility assessment |\n\n### COMPATIBILITY-REPORT.md Contents\n\n- **Interfaces Checked**: Complete list of interfaces evaluated\n- **Compatible (Pass)**: Interfaces that maintain full backward compatibility\n- **Breaking (Fail)**: Interfaces with incompatibilities, each including:\n  - What changed\n  - Who is affected (list consumers)\n  - Migration path (step-by-step instructions for consumers)\n  - Code examples (before and after)\n- **Data Format Changes**: Compatibility of stored/serialized data with new code\n- **Integration Contract Status**: Pass/fail for each external integration\n- **Summary**: Overall compatibility verdict (safe to proceed / blocking issues)\n\n## Quality Criteria\n\n- 100% of public interfaces are checked (none skipped or overlooked)\n- Every breaking change has a concrete migration path with code examples\n- Data format compatibility is tested with representative production data, not just test fixtures\n- Integration contracts are verified against actual contract definitions (not assumptions)\n- Backward compatibility tests exercise real client scenarios, not just unit-level checks\n- Report clearly distinguishes between intentional breaking changes (with migration paths) and unintentional regressions (bugs to fix)",
  "references": [],
  "tags": [
    "migration",
    "compatibility",
    "testing",
    "contracts"
  ],
  "dependsOn": [
    "migration-planner"
  ]
}