{
  "id": "incident-triage",
  "name": "incident-triage",
  "version": "1.0.0",
  "description": "Rapidly classify production incidents by severity, identify blast radius, assign ownership, and determine immediate response strategy. Time-critical first response.",
  "phase": "INIT",
  "category": "core",
  "content": "# Incident Triage\n\nRapidly classify and prioritize production incidents. This is the first response: assess severity, determine who and what is affected, and decide the immediate course of action. Speed matters -- the goal is to make correct decisions quickly, not to find the root cause.\n\n## When to Use\n\n- A production alert fires (monitoring, error tracking, uptime check)\n- Users report an outage, errors, or degraded experience\n- A monitoring threshold is breached (error rate, latency, CPU, memory)\n- A service becomes unresponsive or returns unexpected results\n- A deployment is suspected of causing problems\n\n## Severity Levels\n\n| Level | Name | Definition | Response Time |\n|-------|------|------------|---------------|\n| P0 | Critical | Full outage, all users affected, data loss risk | Immediate (drop everything) |\n| P1 | Major | Major feature broken, significant user impact | Within 15 minutes |\n| P2 | Degraded | Service degraded but functional, partial impact | Within 1 hour |\n| P3 | Minor | Minor issue, cosmetic, low user impact | Within 1 business day |\n\n## Process\n\n1. **Acknowledge the incident** - Confirm the alert or report is valid (not a false positive). Record the timestamp of first detection. Open a communication channel (Slack channel, incident call).\n2. **Classify severity** - Using the severity table above, assign an initial severity level. This can be adjusted as more information becomes available. When in doubt, round up (treat as more severe).\n3. **Identify blast radius** - Determine: How many users are affected? Which services are impacted? Which regions or environments? Is the impact growing or stable?\n4. **Check recent deployments** - Review the last 24 hours of deployments, config changes, and feature flag flips. Correlate timestamps with the start of the incident. Recent changes are the most likely cause.\n5. **Identify likely cause category** - Without deep investigation, categorize the probable cause: deployment regression, infrastructure failure, dependency outage, traffic spike, data issue, or security incident.\n6. **Determine response strategy** - Based on severity and likely cause, select the immediate response: rollback the deployment, disable a feature flag, scale infrastructure, engage a vendor, or apply a hotfix.\n7. **Assign ownership** - Designate an incident commander (coordinates response) and a technical lead (executes the fix). Ensure coverage for the duration of the incident.\n\n## Deliverables\n\n| Deliverable | Format | Purpose |\n|-------------|--------|---------|\n| INCIDENT-TRIAGE.md | Markdown | Triage assessment and response plan |\n\n### INCIDENT-TRIAGE.md Contents\n\n- **Incident ID**: Unique identifier\n- **Severity**: P0-P3 with justification\n- **Blast Radius**: Users affected, services impacted, regions involved\n- **Timeline**: Detection time, acknowledgment time, key observations\n- **Recent Changes**: Deployments, config changes, or flag flips in the last 24 hours\n- **Likely Cause**: Category and brief reasoning\n- **Response Strategy**: Immediate action to take (rollback, hotfix, feature flag, scale)\n- **Assigned Owner**: Incident commander and technical lead\n- **Communication Plan**: Who to notify and where updates will be posted\n\n## Quality Criteria\n\n- Severity is classified within 5 minutes of acknowledgment\n- Blast radius is quantified with specific numbers (not \"some users\")\n- Recent changes are checked (not assumed irrelevant)\n- Response strategy is actionable (specific steps, not \"investigate further\")\n- Ownership is assigned to named individuals, not teams\n- When in doubt, severity rounds up (over-triage is safer than under-triage)",
  "references": [],
  "tags": [
    "incident",
    "triage",
    "production",
    "severity"
  ],
  "dependsOn": []
}