{
  "id": "migration-planner",
  "name": "migration-planner",
  "version": "1.0.0",
  "description": "Plan technology migrations with dependency mapping, risk assessment, rollback strategy, and phased execution timeline. Handles framework upgrades, database changes, and architecture shifts.",
  "phase": "INIT",
  "category": "core",
  "content": "# Migration Planner\n\nPlan technology migrations end-to-end: from current state assessment through phased execution to rollback contingency. Handles framework upgrades, database schema changes, API versioning, dependency updates, and architecture shifts.\n\n## When to Use\n\n- Upgrading a framework or runtime to a new major version\n- Migrating database schemas with production data\n- Introducing API versioning or deprecating old API versions\n- Shifting architecture (monolith to services, REST to GraphQL, etc.)\n- Updating dependencies with breaking changes across the codebase\n- Moving between infrastructure platforms or providers\n\n## Process\n\n1. **Map current state** - Document the current technology stack: frameworks, runtime versions, database schemas, external integrations, and deployment topology. Identify all consumers of the thing being migrated.\n2. **Define target state** - Describe the desired end state precisely. Include versions, schemas, interfaces, and configurations. Define what \"done\" looks like.\n3. **Identify breaking changes** - Compare current to target. Catalog every incompatibility: API signature changes, removed features, behavior changes, schema differences, configuration format changes.\n4. **Map the dependency graph** - Identify which components depend on the thing being migrated. Determine the order in which things must change. Flag circular dependencies.\n5. **Design migration phases** - Break the migration into discrete, independently deployable phases. Each phase should be small enough to reason about and should leave the system in a working state. Define the sequence and estimated duration.\n6. **Define rollback strategy per phase** - For each phase, document how to undo it. Include data migration reversibility, schema downgrade scripts, and service rollback procedures. Estimate rollback time.\n7. **Estimate risk per phase** - Rate each phase by likelihood of failure and impact of failure. Identify the highest-risk phase and plan extra mitigation for it.\n\n## Deliverables\n\n| Deliverable | Format | Purpose |\n|-------------|--------|---------|\n| MIGRATION-PLAN.md | Markdown | Complete migration plan with all sections below |\n\n### MIGRATION-PLAN.md Contents\n\n- **Current State**: Technologies, versions, schemas, integrations in use today\n- **Target State**: The desired end state with specific versions and configurations\n- **Breaking Changes**: Every incompatibility cataloged with severity\n- **Dependency Map**: Which components are affected and in what order\n- **Phased Plan**: Ordered phases with scope, duration estimate, and success criteria per phase\n- **Rollback Strategy**: How to undo each phase, including data reversibility\n- **Risk Matrix**: Likelihood x impact for each phase, with mitigation plans for high-risk items\n- **Success Criteria**: How to verify the migration is complete and correct\n\n## Quality Criteria\n\n- Every breaking change between current and target state is documented\n- A rollback path is defined for each migration phase\n- No orphaned dependencies (nothing left pointing at removed interfaces)\n- Each phase leaves the system in a functional state (no \"big bang\" switchover)\n- Dependency order is correct (no phase depends on a later phase)\n- Risk matrix covers all phases, with specific mitigation for high-risk items\n- Timeline includes buffer for unexpected issues (at least 20% contingency)",
  "references": [],
  "tags": [
    "migration",
    "planning",
    "upgrade",
    "strategy"
  ],
  "dependsOn": []
}