{
  "id": "release-planner",
  "name": "release-planner",
  "version": "1.0.0",
  "description": "Plan releases by scoping included changes, defining version strategy, coordinating cherry-picks, and establishing release criteria. Manages the ceremony of shipping.",
  "phase": "INIT",
  "category": "core",
  "content": "# Release Planner\n\nPlan a release by scoping the changes to include, determining the version number, defining release criteria, identifying blockers, and establishing the rollout strategy. This skill manages the ceremony around shipping: ensuring the right things go out, in the right order, with the right safeguards.\n\n## When to Use\n\n- Before cutting a release from main or a release branch\n- When multiple PRs or features need to be coordinated into a single release\n- When deciding between a major, minor, or patch version bump\n- When cherry-picking fixes into a release branch\n- When establishing go/no-go criteria for a release\n\n## Process\n\n1. **Identify changes since last release** - Use `git log` from the last release tag to HEAD. List all commits, PRs merged, and issues closed. Group by author and component for a complete picture.\n2. **Classify changes** - Categorize each change as: feature (new capability), fix (bug correction), breaking (backward-incompatible change), chore (internal improvement, no user impact), or docs (documentation only). Flag any change that requires user action.\n3. **Determine version bump** - Apply semantic versioning: MAJOR for breaking changes, MINOR for new features (backward compatible), PATCH for bug fixes only. If the release contains both features and fixes, MINOR wins. If it contains breaking changes, MAJOR wins.\n4. **Define release criteria** - Establish the conditions that must be true before the release ships: all tests pass on the release branch, no known P0 or P1 bugs, performance benchmarks within acceptable range, documentation updated for new features.\n5. **Identify release blockers** - Review open issues and PRs tagged for this release. Any unresolved blocker prevents the release. Document each blocker with its status and owner.\n6. **Plan rollout strategy** - Define how the release will be deployed: all at once, canary, staged rollout, or feature-flagged. Include monitoring criteria for proceeding or rolling back at each stage.\n\n## Deliverables\n\n| Deliverable | Format | Purpose |\n|-------------|--------|---------|\n| RELEASE-PLAN.md | Markdown | Complete release plan |\n\n### RELEASE-PLAN.md Contents\n\n- **Version**: Proposed version number with semver justification\n- **Release Date**: Target date (or \"when criteria met\")\n- **Changes Included**: Categorized list of all changes (features, fixes, breaking, chores)\n- **Release Criteria**: Conditions that must be satisfied before shipping\n- **Blockers**: Open issues or PRs that block the release, with owners\n- **Cherry-Picks**: Any commits to cherry-pick into the release branch (with hashes)\n- **Rollout Strategy**: How the release will be deployed (canary, staged, full)\n- **Rollback Plan**: How to roll back if post-release monitoring shows problems\n- **Timeline**: Key dates (code freeze, RC cut, release, post-release monitoring)\n- **Stakeholders**: Who needs to be informed and who gives final approval\n\n## Quality Criteria\n\n- All changes since the last release are accounted for (none missing from the list)\n- Version number follows semver correctly based on the types of changes included\n- Release criteria are testable and specific (not \"everything looks good\")\n- Every blocker has an owner and a resolution plan\n- Rollout strategy includes monitoring and rollback criteria\n- Breaking changes are called out prominently with migration guidance\n- Timeline is realistic and accounts for testing and review time",
  "references": [],
  "tags": [
    "release",
    "planning",
    "versioning",
    "coordination"
  ],
  "dependsOn": []
}