{
  "id": "root-cause-analysis",
  "name": "root-cause-analysis",
  "version": "1.0.0",
  "description": "Systematic root cause identification using 5-whys, git bisect, hypothesis testing, and fault tree analysis. Traces symptoms to their origin.",
  "phase": "SCAFFOLD",
  "category": "core",
  "content": "# Root Cause Analysis\n\nSystematically identify the root cause of a defect using structured analysis techniques. Move beyond symptoms to find the underlying flaw in code, process, or architecture that allowed the bug to exist.\n\n## When to Use\n\n- After a bug has been reliably reproduced (bug-reproducer output available)\n- When the cause of a failure is not immediately obvious from the symptoms\n- For intermittent failures that resist simple debugging\n- When identifying whether a bug is a regression (was it working before?)\n- When multiple symptoms might share a single root cause\n\n## Process\n\n1. **Review the reproduction** - Read the BUG-REPRODUCTION.md. Understand the symptoms, environment, and related code paths identified.\n2. **Form hypotheses** - Generate at least 3 candidate explanations for the observed behavior. Rank them by likelihood based on the evidence available.\n3. **Apply 5-whys analysis** - For each plausible hypothesis, ask \"why?\" iteratively until you reach a root cause that, if fixed, would prevent the symptom from recurring. Stop when you hit a cause that is within the team's control to change.\n4. **Use git bisect if regression** - If the bug worked before, use `git bisect` (or manual equivalent) to identify the exact commit that introduced the regression. Document the commit hash and its changes.\n5. **Test hypotheses with targeted experiments** - For each hypothesis, design a small experiment (add logging, change a parameter, comment out a code path) that would confirm or refute it. Execute and record results.\n6. **Identify the root cause** - Based on evidence from experiments and analysis, select the root cause. Ensure it explains ALL observed symptoms, not just some of them.\n7. **Determine fix approach** - Propose how to fix the root cause. Identify whether the fix is a code change, configuration change, architecture change, or process change. Note any risks the fix introduces.\n\n## Deliverables\n\n| Deliverable | Format | Purpose |\n|-------------|--------|---------|\n| ROOT-CAUSE.md | Markdown | Complete analysis with findings and recommendations |\n\n### ROOT-CAUSE.md Contents\n\n- **Symptom Summary**: Brief restatement of what was observed\n- **Hypotheses Tested**: Each hypothesis, the experiment performed, and the result (confirmed/refuted)\n- **5-Whys Chain**: The chain of \"why?\" questions leading from symptom to root cause\n- **Root Cause Identified**: Clear statement of the root cause\n- **Bisect Result**: If regression, the commit that introduced it\n- **Contributing Factors**: Secondary factors that made the bug possible or harder to detect\n- **Fix Recommendations**: Proposed fix with approach, risks, and estimated effort\n- **Prevention Measures**: What could prevent this class of bug in the future (tests, linting rules, architectural guardrails)\n\n## Quality Criteria\n\n- Root cause explains ALL observed symptoms, not a subset\n- At least 3 hypotheses were considered (avoids confirmation bias)\n- Each hypothesis was tested with evidence, not just reasoned about\n- 5-whys chain reaches a cause within the team's control\n- Fix recommendation addresses the root cause, not just the symptom\n- Prevention measures address the systemic issue (not one-off patches)\n- If a regression, the exact introducing commit is identified",
  "references": [],
  "tags": [
    "debugging",
    "analysis",
    "root-cause",
    "diagnosis"
  ],
  "dependsOn": [
    "bug-reproducer"
  ]
}